---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveElement
source: html/9210e6a1-a316-9424-8a68-54c01b2c1587.htm
---
# CurveElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.